USE SalesDB;

INSERT INTO Cities (name)
VALUES
    ('София'),
    ('Пловдив'),
    ('Варна'),
    ('Бургас'),
    ('Русе'),
    ('Плевен'),
    ('Шумен');

INSERT INTO Clients (fName, lName, ucn, cityId, address, phone, eMail)
VALUES
    ('Иван', 'Петров', '9865321456', 1, 'ул. Пролет 10', '0887541236', 'ivan_petrov@abv.bg'),
    ('Никола', 'Попов', '8956232563', 3, 'ул. Мир 8', '0898231254', 'nikola_popov@mail.bg'),
    ('Стефка', 'Стоянова', '8523678941', 4, 'ул. Дунав 21', '0859631487', 'stefka_856@abv.bg');

INSERT INTO WareTypes (name)
VALUES
    ('Месни продукти'),
    ('Млечни продукти'),
    ('Плодове'),
    ('Зеленчуци');

INSERT INTO Wares (name, price, typeId)
VALUES
    ('Салам', 4.50, 1),
    ('Домати', 2.20, 4),
    ('Сирене', 6.50, 2),
    ('Ябълки', 1.25, 3),
    ('Кисело мляко', 0.86, 2),
    ('Прясно мляко', 1.50, 2),
    ('Свинско месо', 8.20, 1),
    ('Краставици', 1.50, 4),
    ('Праскови', 3.20, 3);